README.md
```mermaid
classDiagram
direction BT

class criteres {
   text CH
   text ECS
   text emetteur
   text espace_exterieur
   text env_contraint
   text toiture_terrasse
   text temperature
   text nb_lgts
   text niveau_renovation
   integer id
}
class solutions {
   text name
   text type
   text usage_CH
   text usage_ECS
   text usage_FR
   text num_AFPAC
   text emprise_PAC_exterieur
   text local_technique
   text emprise_logement
   text structure
   text acoustique
   text reseaux_hydrauliques
   text PLU
   text raccordement_electrique
   text impact_visuel
   text note_impact_visuel
   text note_Impact_sonore
   text note_impact_espace_exterieur
   text note_environnemental
   text note_maturite
   text commentaire_app
   text commentaire_pouget
   text id
}
class solutions_par_criteres {
   integer criteres_id
   text id_solution
   integer ordre_solution
   text difficulte
   text impact_travaux_coll
   text impact_travaux_indiv
   text cout
   text type_solution
   text usage_CH
   text usage_ECS
   text usage_FR
   integer alertes
}


solutions_par_criteres  -->  solutions : id_solution

solutions_par_criteres  -->  criteres : criteres_id
```
