assets/schema.dot
digraph structs {


rankdir="LR"


node [shape=none]

criteres [label=<
            <TABLE BORDER="0" CELLSPACING="0" CELLBORDER="1">
                <TR>
                    <TD COLSPAN="2"><B>criteres</B></TD>
                </TR>
            
                <TR>
                    <TD PORT="id_to">🔑</TD>
                    <TD PORT="id_from">id</TD>
                </TR>
            

                <TR>
                    <TD PORT="CH_to">&nbsp;</TD>
                    <TD PORT="CH_from">CH</TD>
                </TR>
            

                <TR>
                    <TD PORT="ECS_to">&nbsp;</TD>
                    <TD PORT="ECS_from">ECS</TD>
                </TR>
            

                <TR>
                    <TD PORT="emetteur_to">&nbsp;</TD>
                    <TD PORT="emetteur_from">emetteur</TD>
                </TR>
            

                <TR>
                    <TD PORT="espace_exterieur_to">&nbsp;</TD>
                    <TD PORT="espace_exterieur_from">espace_exterieur</TD>
                </TR>
            

                <TR>
                    <TD PORT="env_contraint_to">&nbsp;</TD>
                    <TD PORT="env_contraint_from">env_contraint</TD>
                </TR>
            

                <TR>
                    <TD PORT="toiture_terrasse_to">&nbsp;</TD>
                    <TD PORT="toiture_terrasse_from">toiture_terrasse</TD>
                </TR>
            

                <TR>
                    <TD PORT="temperature_to">&nbsp;</TD>
                    <TD PORT="temperature_from">temperature</TD>
                </TR>
            

                <TR>
                    <TD PORT="nb_lgts_to">&nbsp;</TD>
                    <TD PORT="nb_lgts_from">nb_lgts</TD>
                </TR>
            

                <TR>
                    <TD PORT="niveau_renovation_to">&nbsp;</TD>
                    <TD PORT="niveau_renovation_from">niveau_renovation</TD>
                </TR>
            
            </TABLE>
        >];
        
solutions [label=<
            <TABLE BORDER="0" CELLSPACING="0" CELLBORDER="1">
                <TR>
                    <TD COLSPAN="2"><B>solutions</B></TD>
                </TR>
            
                <TR>
                    <TD PORT="id_to">🔑</TD>
                    <TD PORT="id_from">id</TD>
                </TR>
            

                <TR>
                    <TD PORT="name_to">&nbsp;</TD>
                    <TD PORT="name_from">name</TD>
                </TR>
            

                <TR>
                    <TD PORT="type_to">&nbsp;</TD>
                    <TD PORT="type_from">type</TD>
                </TR>
            

                <TR>
                    <TD PORT="usage_CH_to">&nbsp;</TD>
                    <TD PORT="usage_CH_from">usage_CH</TD>
                </TR>
            

                <TR>
                    <TD PORT="usage_ECS_to">&nbsp;</TD>
                    <TD PORT="usage_ECS_from">usage_ECS</TD>
                </TR>
            

                <TR>
                    <TD PORT="usage_FR_to">&nbsp;</TD>
                    <TD PORT="usage_FR_from">usage_FR</TD>
                </TR>
            

                <TR>
                    <TD PORT="num_AFPAC_to">&nbsp;</TD>
                    <TD PORT="num_AFPAC_from">num_AFPAC</TD>
                </TR>
            

                <TR>
                    <TD PORT="emprise_PAC_exterieur_to">&nbsp;</TD>
                    <TD PORT="emprise_PAC_exterieur_from">emprise_PAC_exterieur</TD>
                </TR>
            

                <TR>
                    <TD PORT="local_technique_to">&nbsp;</TD>
                    <TD PORT="local_technique_from">local_technique</TD>
                </TR>
            

                <TR>
                    <TD PORT="emprise_logement_to">&nbsp;</TD>
                    <TD PORT="emprise_logement_from">emprise_logement</TD>
                </TR>
            

                <TR>
                    <TD PORT="structure_to">&nbsp;</TD>
                    <TD PORT="structure_from">structure</TD>
                </TR>
            

                <TR>
                    <TD PORT="acoustique_to">&nbsp;</TD>
                    <TD PORT="acoustique_from">acoustique</TD>
                </TR>
            

                <TR>
                    <TD PORT="reseaux_hydrauliques_to">&nbsp;</TD>
                    <TD PORT="reseaux_hydrauliques_from">reseaux_hydrauliques</TD>
                </TR>
            

                <TR>
                    <TD PORT="PLU_to">&nbsp;</TD>
                    <TD PORT="PLU_from">PLU</TD>
                </TR>
            

                <TR>
                    <TD PORT="raccordement_electrique_to">&nbsp;</TD>
                    <TD PORT="raccordement_electrique_from">raccordement_electrique</TD>
                </TR>
            

                <TR>
                    <TD PORT="impact_visuel_to">&nbsp;</TD>
                    <TD PORT="impact_visuel_from">impact_visuel</TD>
                </TR>
            

                <TR>
                    <TD PORT="note_impact_visuel_to">&nbsp;</TD>
                    <TD PORT="note_impact_visuel_from">note_impact_visuel</TD>
                </TR>
            

                <TR>
                    <TD PORT="note_Impact_sonore_to">&nbsp;</TD>
                    <TD PORT="note_Impact_sonore_from">note_Impact_sonore</TD>
                </TR>
            

                <TR>
                    <TD PORT="note_impact_espace_exterieur_to">&nbsp;</TD>
                    <TD PORT="note_impact_espace_exterieur_from">note_impact_espace_exterieur</TD>
                </TR>
            

                <TR>
                    <TD PORT="note_environnemental_to">&nbsp;</TD>
                    <TD PORT="note_environnemental_from">note_environnemental</TD>
                </TR>
            

                <TR>
                    <TD PORT="note_maturite_to">&nbsp;</TD>
                    <TD PORT="note_maturite_from">note_maturite</TD>
                </TR>
            

                <TR>
                    <TD PORT="commentaire_app_to">&nbsp;</TD>
                    <TD PORT="commentaire_app_from">commentaire_app</TD>
                </TR>
            

                <TR>
                    <TD PORT="commentaire_pouget_to">&nbsp;</TD>
                    <TD PORT="commentaire_pouget_from">commentaire_pouget</TD>
                </TR>
            
            </TABLE>
        >];
        
solutions_par_criteres [label=<
            <TABLE BORDER="0" CELLSPACING="0" CELLBORDER="1">
                <TR>
                    <TD COLSPAN="2"><B>solutions_par_criteres</B></TD>
                </TR>
            
                <TR>
                    <TD PORT="criteres_id_to">&nbsp;</TD>
                    <TD PORT="criteres_id_from">criteres_id</TD>
                </TR>
            

                <TR>
                    <TD PORT="solutions_id_to">&nbsp;</TD>
                    <TD PORT="solutions_id_from">solutions_id</TD>
                </TR>
            

                <TR>
                    <TD PORT="ordre_solution_to">&nbsp;</TD>
                    <TD PORT="ordre_solution_from">ordre_solution</TD>
                </TR>
            

                <TR>
                    <TD PORT="difficulte_to">&nbsp;</TD>
                    <TD PORT="difficulte_from">difficulte</TD>
                </TR>
            

                <TR>
                    <TD PORT="impact_travaux_coll_to">&nbsp;</TD>
                    <TD PORT="impact_travaux_coll_from">impact_travaux_coll</TD>
                </TR>
            

                <TR>
                    <TD PORT="impact_travaux_indiv_to">&nbsp;</TD>
                    <TD PORT="impact_travaux_indiv_from">impact_travaux_indiv</TD>
                </TR>
            

                <TR>
                    <TD PORT="cout_to">&nbsp;</TD>
                    <TD PORT="cout_from">cout</TD>
                </TR>
            

                <TR>
                    <TD PORT="type_solution_to">&nbsp;</TD>
                    <TD PORT="type_solution_from">type_solution</TD>
                </TR>
            

                <TR>
                    <TD PORT="usage_CH_to">&nbsp;</TD>
                    <TD PORT="usage_CH_from">usage_CH</TD>
                </TR>
            

                <TR>
                    <TD PORT="usage_ECS_to">&nbsp;</TD>
                    <TD PORT="usage_ECS_from">usage_ECS</TD>
                </TR>
            

                <TR>
                    <TD PORT="usage_FR_to">&nbsp;</TD>
                    <TD PORT="usage_FR_from">usage_FR</TD>
                </TR>
            
            </TABLE>
        >];
        
solutions_par_criteres:solutions_id_from:e -> solutions:id_to:w
solutions_par_criteres:criteres_id_from:e -> criteres:id_to:w

}
